[
  {
    "ask": "Dexmo与其他VR手套有何不同？",
    "answer": "同仅仅基于磁场，弯曲传感器或基于光学追踪的纯动作捕捉方案相比，Dexmo凭借其独特的力反馈技术提供了前所未有的沉浸感。与其他力反馈手套相比，Dexmo是世界上首款无线、轻便、双手手套。在我们开发的多功能手部交互物理引擎的支持下，它提供了最引人入胜的力反馈体验。"
  },
  {
    "ask": "如何实现力反馈？",
    "answer": "Dexmo捕捉你的手部动作，并将数据发送给虚拟现实世界中的手部模型。当你的手部模型触碰到一个虚拟物体时，我们的抓取处理软件就会启动，它计算作用于五个指尖的力的矢量方向和幅度。Dexmo提供可变力反馈，让你可以实时感受到该虚拟物体，比如旋转虚拟旋钮、拉动虚拟控制杆、打开一扇虚拟门的感觉。你处在一个虚拟的环境中，但感觉却像在现实中一样。"
  },
  {
    "ask": "什么是可变刚度？如何为虚拟环境中的物体设置刚度？",
    "answer": "通过对位置和力的精确控制，Dexmo可以模拟虚拟物体的力反馈，就像计算机控制刚度的虚拟弹簧一样。例如，Dexmo可以让用户感受到抓握虚拟石头和挤压虚拟橡皮鸭之间的区别。通过我们的简单易用的SDK，用户可以在为Unity或UE4构建的插件中设置刚度。"
  },
  {
    "ask": "Dexmo具有位置追踪吗？如果具有的话，如何做到这一点？",
    "answer": "Dexmo捕捉11个自由度的手部运动，包括每根手指的伸展和弯曲，以及大拇指一个额外的旋转自由度。这种追踪并非依赖于IMU数据，而是使用旋转传感器，这意味着它不会受到磁场的影响，从而产生更可靠的数据。"
  },
  {
    "ask": "如何在三位空间中对Dexmo进行空间追踪？Dexmo兼容哪些追踪系统？",
    "answer": "对于三维空间的位置追踪，Dexmo可以搭配几乎所有现有的6自由度的位置数据的跟踪系统，如Opti-track、Oculus、Sony PSVR定位追踪系统和Vive的Lighthouse定位追踪系统。实现空间定位追踪，需要将定位器或手柄控制器安装在一个我们提供的可拆卸支架上并固定于Dexmo。只要有6自由度的数据输入，Dexmo就可以与该定位追踪系统兼容。"
  },
  {
    "ask": "Dexmo兼容哪些头戴显示器和开发平台？",
    "answer": "Dexmo的SDK支持Unity 3D（基于c#）和Unreal Engine（基于c++），Dexmo兼容所有Unity/UE4项目。Dexmo没有搭配特定的头显，理论上，每一款高端VR/MR头显都是受支持的，它支持几乎所有主流的头显，如Oculus CV1、DK2、Vive、Vive Pro、PSVR，甚至HoloLens、Microsoft MR等。但是，不同的定位器需要不同的固定支架支持，Dexmo DK1配备了Oculus CV1手柄、Vive定位器和Vive手柄的固定支架。"
  },
  {
    "ask": "所有的手型大小都适用Dexmo吗？",
    "answer": "Dexmo通过可调节的手掌绑带和手指绑带适配大多数人的手型，但从统计学上讲，可穿戴设备永远不可能覆盖100%的人群。手特别小或特别大的人可能活动范围有限。如果您不确定您的手大小是否适合，您可以通过电子邮件与我们联系。"
  },
  {
    "ask": "是否需要手部校准？每次使用都需要吗？",
    "answer": "为了更好的体验，我们推荐进行手部校准。每人只需要校准一次，我们的程序会记录您的手的大小，您只需要在重新启动的时候选择自己的手模档案。另外，为了方便使用和节省时间，您也可以选择我们预设的手模，近似拟合实际的手型。"
  },

  {
    "ask": "目前Dexmo Development Kit的价格是多少？",
    "answer": "目前我们尚未公布确切的零售价格。由于目前我们主要在与不同行业和研究机构的客户开展商务合作，所以单价根据不同情况会有所不同。如果您有兴趣购买Dexmo，请与我们的销售团队联系。"
  },
  {
    "ask": "Dexta Robotics会为公众开发消费者版本吗？",
    "answer": "是的。我们的目标是不仅为行业客户，更为一般消费者制造最轻便易用的力反馈手套。但是，由于规模经济，我们还需要一段时间才能开始直接向个人买家销售产品。我们正稳步实现这一目标，请耐心等待：）"
  },
  {
    "ask": "我可以试用Dexmo吗？",
    "answer": "是的。我们在全球范围提供Dexmo的试用体验。除了光临参加的各种VR活动外（我们将会在官网主页显示活动预告），我们也欢迎您到我们的办公室参观体验。我们的总部位于中国深圳，另外两家海外办事处分别位于英国剑桥郡和美国加州帕洛阿尔托。您可以通过电子邮件与我们的销售代表取得联系，预约体验。"
  }
]
