<template>
  <div id="main" class="text-left text-white">
    <div>
      <this-header />
      <div class="article__1tkBY">
        <div class="catalogue__Ih0MZ">
          <div><a @click="goAnchor('id1')">项目的开端</a></div>
          <div><a @click="goAnchor('id2')">为何交互很重要</a></div>
          <div><a @click="goAnchor('id3')">背景知识普及</a></div>
          <div><a @click="goAnchor('id4')">产品的发展</a></div>
        </div>
        <div class="begin__3d1P0">
          <div>
            <p>
              由于部分读者尚不了解我们的产品，我先向大家介绍一下：Dexmo是一款商业化便携式双手无线力反馈手套，兼具手部动作捕捉与力反馈功能，可广泛应用于工业培训、教育科研、医疗康复、游戏社交、仿真建模、航空航天等领域。Dexmo是最易于使用的力反馈手套，为研究者、企业、消费者而生。它所提供的自然、直觉的触感可以让每一个人无缝触碰真正沉浸式的VR世界。
            </p>
            <p>
              现在四处常见各种精美的技术概念演示。与它们相比，Dexmo的特别之处在于它的完成度远远高于一个概念。它不仅仅是可以工作的原型机，而是体验优秀，并已经投入大批量生产的产品。我们正在将这项技术进一步推向大众。
            </p>
            <p>
              在介绍产品细节之前，我想先给大家分享我的一些想法，包括我们为什么要做这件事、交互在VR中的重要性、我们前进的动力，以及产品的最新进展。
            </p>
          </div>
          <div class="video__3mb7h">
            <ul class="video__bVhmv">
              <this-video
                :item="{
                  cover: '/img/pro-20.png',
                  src:
                    'https://oss-main.dextarobotics.com/videos/experience/1-factory.mp4',
                }"
              />
            </ul>
          </div>
        </div>
        <div class="begin__3d1P0">
          <a id="id1"></a>
          <h2>项目的开端：</h2>
          <div>
            <p>
              在2013年我第一次看到Oculus
              Rift的时候，我为它的概念感到振奋不已，见到它的发展，我开始意识到这远不仅仅是个游戏配件，而是朝着未来媒介新篇章迈出的第一步。我们回顾信息传播媒介的发展历史：从写信开始，到传送照片、印刷报纸，再到听广播、看电视、使用个人电脑、智能手机，人类已经走过一段漫长的道路。在历史的演进中，技术的进步令我们能够以不断增长的信息密度进行沟通。人类持续全力发展技术，创造尽可能还原我们现实生活中交互方式的体验。
            </p>
            <p>
              但是现今的技术能够让远距离沟通变得跟面对面交流一样吗？答案是不能。他们并不能看到彼此的肢体动作，也不能亲手拿起东西递给对方，这里还有很多需要改进的地方。每当一项逐渐完善的技术媒介成熟时，就将彻底改变几代人的生活。将一切由2D转换为3D的VR/MR技术是我们必将迎来的合理发展，但它究竟将以何种形式落地呢？
            </p>
            <p>
              很多人致力于研发头显，但要想获得完全沉浸式的体验，只有优秀的头显是不够的，还有一些同样重要的问题需要解决。我们都见过那种傻乎乎的图片：有人带着头显，双手在面前比划，但其实根本这双手根本没有被带进VR里。我意识到这里明显有所缺失，那就是手部设备，手是我们思想的延伸，能够使最自然的人类互动成为可能。
            </p>
          </div>
          <img src="/img/pro-2.gif" />
          <div>
            <p>
              不仅仅是我自己，很多VR爱好者曾告诉我，他们不仅想在VR中使用自己的手，还想感受自己所抓住的物体，可惜这样的技术当时并不存在。当时最接近这样需求的产品大多要通过电缆连接远在另一端的电机箱，它们体积庞大又过时，难以制造和维护，而且对普通消费者来说过于复杂。
            </p>
            <p>
              我一直对机器人技术充满热情，我喜欢挑战，因此，我觉得有责任用自己对技术的理解寻找答案：别管过去的数据手套，对消费者友好的力反馈手套到底应该是什么样子呢？有了这个想法后，我们从头开始重新设计一切，这就是Dexmo项目的开端。
            </p>
          </div>
        </div>
        <div class="begin__3d1P0">
          <a id="id2"></a>
          <h2>为何交互很重要：</h2>
          <div>
            <p>
              当个人电脑刚被发明出来的时候，它只是少数人使用的酷玩意，当时人们得先知道怎么用命令行才能使用电脑。直到鼠标和图形用户界面（GUI）被引入系统，让没有任何技术背景的人也可以使用PC后，PC才开始进入主流市场。假如Win3.0没有这么友好的用户界面，很难想象它还能不能卖出400多万套。
            </p>
            <p>
              在iPhone问世之前，市场上已经有数十家企业尝试推出智能手机，但由于价格昂贵、使用方法复杂，所以并未引起广大普通消费者的注意。然而，iPhone凭借其令人惊叹的触摸屏和基于触摸的GUI界面获得了成功。当一个五岁的孩子不必阅读使用手册，只要用手指随意滑动就能开始玩游戏时，你就知道iPhone在降低学习成本方面取得了巨大的成功。
            </p>
            <p>
              VR/
              MR也面临着同样的问题。新的媒体技术必须真正“易于使用”，才能进入大众市场，但找到最合适的方法并不容易。尽管我很欣赏手柄，但它还不够简单和直觉。资深游戏玩家自然都知道如何使用手柄，但如果是新手，则可能需要很长时间才能习惯按键和摇杆的控制。那我们该怎么解决这个问题呢？
            </p>
            <p>当iPhone问世时，乔布斯有段名言：</p>
          </div>
          <div class="jobs__1Nf9w">
            <div>
              <p>
                不管你需不需要，它们（市面上的其他智能手机产品）都会配置键盘，不论你是否真的需要它们。
              </p>
              <p>
                它们对每个软件程序来说都一样毫无变化，因为这些实体键盘和控制按键都被固定在塑料上了。但其实每个应用都需要一点独特的用户界面，针对不同应用，需要对键盘进行一些针对性优化改变。
                但是如果六个月后你想出一个好主意想添加进产品里，你不能再继续加一个按键了，因为产品都已经发货了。
              </p>
              <p>那该怎么办？</p>
              <p>
                无解，因为按键和控制系统不能调整了，它不能为每一个应用程序而改变，他未来也不能被再加入整个系统，即便将来你想到另一个好主意想加入这个产品。
              </p>
            </div>
          </div>
          <img src="/img/pro-3.png" />
          <div>
            <p>
              我认为这与当前VR的发展情况非常相似。手柄有固定的按键和摇杆，只能非常有限地部分重建手部交互的体验。开发者必须根据特定的手柄硬件来调整他们的应用程序，而不是直接根据我们使用手的自然习惯在不同的应用程序中构建不同的交互方式。用户必须首先学习如何使用硬件才能使用应用程序，这就限制了市场的增长，更使得开发者越来越难以赚钱。
            </p>
            <p>
              在软件生态系统中有一个众所周知的悖论，即“先有用户还是先有开发者”。在过去的几年里，我思考了很久，得出了一个结论：先有用户。每当一个新的生态系统诞生时，如果它不能吸引足够的用户，那么从长远来看，开发者就不会有足够的动力继续为这个平台开发。Surface
              RT就是一个典型的反面案例，Oculus在早期也是如此。关键在于降低用户进入这个系统的成本，当用户不需要花费学习成本就可以加入平台时，即使只有几个应用程序，他们也会加入，因为对于用户来说平台的吸引力大于阻力。和iPhone刚问世时的情况类似，iPhone的界面和使用非常直观明了，以至于那些认为自己不需要智能手机的人也开始使用它。简单的游戏可以帮助开发者赚取数百万美元，这会鼓励更多开发者加入。这也是VR所需要的生态系统，这就是为什么我坚信我们能够帮助VR行业形成这样的生态系统。
            </p>
            <p>
              举个例子，想象你在现实生活中打开一张地图，你会怎么做？你将从背包里拿出地图，然后打开来看。这种体验其实可以通过合适的交互技术实现，而在当前的VR硬件条件下，这就变成了：“按下手柄侧面的抓握键打开菜单，然后用另一个手柄上的光束瞄准菜单里的地图选项，然后按下扳机键确认你的选择。”
              这本该是个简单的操作，却由于目前硬件的限制而变得很复杂。
            </p>
            <p>
              其实从工程学角度来看，这是有道理的。因为打造性能稳定的手柄要比创造力反馈手套容易得多。请别误会，我非常欣赏手柄，如果没有手柄，VR中甚至还不会有任何引入手部交互的体验。不过我们不能就此止步，虽然困难重重，但是我们应该做正确的事，而不是轻松的事。我们必须不断改进我们的技术，直到它变得”傻瓜式的简单”，因为只有到那时，普通人，而不仅仅限于游戏玩家或是VR爱好者，才会开始使用VR。这就是我们开发这个产品的动力。
            </p>
          </div>
        </div>

        <div class="begin__3d1P0">
          <a id="id3"></a>
          <h2>背景知识普及：</h2>
          <p>
            在我深入讨论产品之前，我应该列出一些背景资料，并指出一些人机交互领域常见的误解，以便大家更好的理解。
          </p>
          <img src="/img/pro-4.jpeg" />
          <div>
            <p>
              上图展示了VR中一些具有代表性的人机交互（HCI）工具，我不是按发布日期，而是基于功能来排序的。为了简单明了起见，我对每个功能都使用了“勾”和“叉”的简单标注，但这是不足以描述其中细微的差别的，为了完全理解它们，我会做进一步的解释。
            </p>
            <p>
              让我们从游戏玩家熟悉的普通手柄开始。它有控制按键、摇杆和提供反馈的振动电机。然而，它并没有将手的存在带入VR，更不用说位置追踪了。PS4手柄解决了追踪问题，但仍然受到很多限制。
            </p>
            <p>
              随后出现的一个里程碑是Vive操控手柄，用户首次可以将双手位置数据分别输入回VR，并通过扣动扳机键来拾取物体。手柄的两侧各有一个抓握按钮，目的是让人们轻松地“抓握虚拟物体”，但实际上用户使用时并没有感到特别轻松方便，许多人在松开控制按钮时就会下意识的让手柄从手中掉落，这让他们感到困惑和不习惯。
            </p>
          </div>
          <img src="/img/pro-5.gif" />
          <p>
            Oculus
            Touch提供了Vive手柄所提供的大部分功能之外，还提供了更好的人体工学改进，以及简单的部分手指追踪功能：拇指和食指开关式追踪（只有张开和握紧）。它无法模拟（连续的）手指弯曲的精确追踪，而且只作用于两根手指。另外的三指弯曲检测是通过一个抓握按钮来实现的。它让用户更进一步地感受到了虚拟世界中手部的存在，但它仍然受到许多方面的限制。
          </p>
          <img src="/img/pro-6.gif" />
          <p>
            Valve公司的Knuckles（现在叫做Index控制器）在Touch所提供功能的基础上，进一步改进了手部追踪功能。它在手柄上安装了一组额外的传感器，以实现全手五指跟踪，并开发了一种非常创新的人体工程学穿戴方式，让用户可以完全张开手而不会掉落手柄，它是目前最完善的操控手柄。尽管如此，它的手指跟踪仍然很受限制（只有不到30度的连续弯曲检测，对于超过30度的手指弯曲幅度只能检测为张开或握紧），并且只有有限的五个自由度：每根手指一个自由度，这意味着你不能将大拇指的旋转自由度和四根手指的展开自由度输入到VR中。
          </p>
          <p>
            而Leap
            motion和其它一些基于视觉的手部追踪解决方案则属于不同的技术路径。它们提供真实手部尺寸大小的全手追踪与连续的手指弯曲追踪，但可以理解的是，它不提供任何反馈方案，甚至连基于振动的触觉反馈也没有。尽管它拥有较高的精度和自由度（尤其是手指的展开的自由度和拇指的灵活度），但跟踪的可靠性仍成问题。由于它基于视觉的解决方案，如果手到相机的光路被遮挡，它会立即丢失跟踪数据。
          </p>
          <img src="/img/pro-7.gif" />
          <div>
            <p>
              数据手套是另一种精确手部追踪的技术路径。大多数数据手套使用基于弯曲传感器或基于惯性测量单元（IMU）的解决方案，并根据使用的传感器数量追踪5
              -10自由度的手部运动，使其能够捕捉连续的手指弯曲。弯曲传感器根据其物理变形来改变电阻，这意味着传感器的使用寿命有限。而基于IMU的解决方案则使用磁场传感器、加速度计和陀螺仪进行多传感器数据融合，以重建每根手指的三自由度方向，并使用逆向运动学来反算重新生成手部模型。优点是传感器本身不发生物理变形，因此它不会有损耗，但由于它是基于惯性的性质，数据的可靠性不高，长时间使用容易导致“数据漂移”，因此需要频繁地重新校准。它的可靠性受金属、磁体和周围磁场的影响，这就是为什么很难把多个振动电机放在IMU手套附近。因为每当电机启动时，磁场就会发生变化，数据的稳定性就会受到影响。而这反映在用户体验上就是：手部模型会突然看起来很扭曲奇怪。这种特性限制了数据手套的反馈系统，这就是为什么我们看到许多IMU数据手套只有一个电机安装在手腕上：显然，这样的电机数量和位置并不是最佳的解决方案。
            </p>
            <p>
              最后是我们的解决方案，这个机械外骨骼随着用户的手指一起运动，将其运动传至内置的角度传感器，并且在每个指尖产生力反馈。它可以捕获11自由度的手部运动，从而能够重建非常真实的手部模型。力反馈功能在物理上阻止用户的手穿透虚拟物体，从而让用户感受其形状、大小和刚度。虽然它比其他解决方案体积稍大，但却是一种非常可靠的捕捉连续的手手指运动的方式，也给了我们足够的空间来放置力反馈装置。在不牺牲手部灵活性的前提下，我们在商业化数据手套历史上第一次成功地将力反馈添加到了便携式手套中
            </p>
            <p>
              如果我们回顾手柄的发展史，它的发展趋势是非常明显的。在VR中手部的交互已经变得越来越重要，人们尝试了不同的方案来解决这个问题，每个产品都经过了多方面的权衡。手柄路径试图将手指追踪添加到其硬件中，但由于硬件尺寸和所选择的追踪方式，使得追踪精度和力反馈能力受到限制。这是他们不愿意放弃手柄形式的代价，因为手柄的制造成本相当低，并且目前它已经有很大的玩家群体基础。但如果我们想要使用者突破与现有的玩家群体，就需要做出进一步的改变。基于视觉的追踪不需要用户穿戴任何东西，这降低了“穿戴成本”，但不稳定的追踪会立刻打破沉浸感，并且反馈的缺失会让用户很难知道自己在虚拟世界中正在做什么。而数据手套则介于以上两者之间，虽然它有时会出现小故障，但它提供了相对可靠的手部追踪并能够提供某种形式的反馈。不过相比于轻松地拿起手柄，费劲穿戴数据手套会阻碍它的易用性，而且它使用的单点式反馈也没有给用户的手部足够的反馈信息。一个真正能够平衡以上各方面问题且易于使用的解决方案还尚待发掘。
            </p>
            <p>
              我并不是说Dexmo是人机交互（HCI）的最佳方案，因为它还有很多需要改进的地方。可能会需要温度、纹理和许多其它反馈以不断提高沉浸感，但力反馈确实给VR带来了难以置信的沉浸感，这无疑是一个巨大的进步。
            </p>
            <p>
              我想补充的另一点是反馈的添加必须遵循一定的顺序。力反馈涉及到电机的放置和传动，因此占用了很大的空间，这会极大地改变它的整体形态。首先解决了这个问题，然后添加其他形式的反馈，要比按照其它顺序来做容易得多。这就是为什么我认为我们的外骨骼设计标志着VR人机交互革命的良好起点。
            </p>
          </div>
        </div>
        <div class="begin__3d1P0">
          <h2>一些常见的误解</h2>
          <h3>整体追踪和局部追踪：</h3>
          <p>
            整体追踪（定位追踪）和局部追踪（手指/
            手部追踪）是不同的概念。在文章中当我谈到手套时，我主要关注的是它们的局部追踪能力。手套的定位追踪可以通过附加现有的追踪技术（如Vive追踪器、OptiTrack
            标记等）来实现，所以我在上面的讨论中省略了这一部分。
          </p>
          <h3>手指追踪和手部追踪：</h3>
          <p>
            尽管许多硬件都多少加入了手部感知交互功能，但他们实现的程度并不相同。这里比较的主要标准是“手指弯曲的连续性”、“自由度”、“可靠性”和“整体体验”几个方面，而不仅仅是被多数人错误使用的“精度”。如果人们评价某个“精确但不可靠”的解决方案要比某个”可靠且具有更高的自由度但不那么精确”
            的解决方案更好，这是不公平的，我们的评判标准不应该只有精度。
          </p>
          <p>
            在VR中，手指能够连续动作并以任意角度弯曲，与手指只能开关式地做到展开或弯曲两种状态是不同的。这种差异是由不同的追踪方法造成的，Touch和Knuckles都使用了接近传感器对手指进行两种状态的检测，因此它们只能检测手指的“按压”和“松开”两个状态，并通过动画对图形进行补偿，只能捕捉3或5自由度的手指动作。而数据手套和基于视觉的解决方案可以在更高的数值范围精确检测手指弯曲，并检测更高自由度的手部运动。手柄产生开关式的数据，所以它们的可靠性较高；而基于视觉的解决方案虽然有较高的精度，但由于存在因视觉阻挡造成的数据跟踪丢失问题，其整体体验存在争议。
          </p>
          <p>
            拇指追踪本身也很重要。对于大多数手部追踪解决方案，其目的只是单纯的重建看起来像真手的虚拟手，而不是重建基于真手运动原理的虚拟手。例如，当你用手柄抓取虚拟物体时，虚拟的手会自动合拢呈抓握状态，然后手柄会振动。足够逼真的手部模型和动画效果可以达到障眼法的效果，在不需要将特定的反馈应用在各个手指的时候，这是可行的。但这不是真实的力反馈，甚至算不上触觉反馈。为了让力或振动发生在适合的位置并输出适合的大小，手的虚拟重建需要尽可能接近真实。我们的拇指有3个自由度，如果我们一开始就忽略拇指数据，那我们就不可能准确提供反馈。这就是为什么我们的Dexmo
            具备捕捉所有拇指动作的能力。
          </p>
          <h3>触觉和力反馈</h3>
          <p>
            触觉这个词现在被过于宽泛地使用，以至于产生了一定误导性。触觉的原意是“涉及触觉的任何交互方式”，它涵盖了很多方面：振动、纹理、温度、力传导。由于许多游戏手柄都内置振动电机，然后以“触觉反馈”的名义进行宣传，许多人便将“触觉”视为狭义的“振动”，这是种常见的误解。
          </p>
          <p>
            触觉其实有多种形式。为了帮助大家理解，我将以产品为例，主要解释不同类型的振动和力反馈的区别：
          </p>
          <ul>
            <li>
              单点振动：Xbox手柄（手柄两侧各两点），操控手柄，部分数据手套。
            </li>
            <li>多点振动：VR触觉反馈背心，其多个电机均匀分布在整个表面。</li>
            <li>
              单点式力反馈： Sensable Phantom力反馈设备，Novint Falcon
              力反馈控制器，它们在一个点提供6自由度的力反馈。
            </li>
            <li>多点式力反馈：Dexmo，为多个点提供局部力反馈。</li>
          </ul>
        </div>
        <div class="begin__3d1P0">
          <a id="id4"></a>
          <h2>产品发展史：</h2>
          <p>
            在我开始做这项工作之前，我花了大量的时间思考如何让任何人都可以轻松使用Dexmo，结论是各个方面都需要降低成本。我所指的不单单是硬件成本，还包括使用它所需的学习成本、穿戴成本、硬件制造成本、软件开发成本等。这些可以分解为产品的许多不同方面，例如，为了让人们自然顺畅地使用它，产品本身不能太大太重，如果它太重，或者它的大小会延伸覆盖到手腕，或者还有连接线把你拖拽住，那它就不是个对用户友好的产品，因为每次你意识到有连接线在那里拖着的时候就会打破VR的沉浸感。这些就是我们需要解决的问题，我们知道了创造这个产品有大小和重量的限制，以及各种各样的其他限制，那么我们就必须找出最佳方案。我们牢记着这个方向和原则，开始了我们的探索与研究。
          </p>
          <img src="/img/pro-8.png" />
          <div>
            <p>
              在2014年我们首次公开亮相，我最初的想法是打造一个外骨骼，不仅可以捕捉手部运动，还可以在它的指尖提供基于微型制动盘结构的开关式力反馈功能。这个尝试成功了，它确实可行，但还不够好。最大的缺陷是高延迟和机械制动器导致的不连续力反馈。所以我们又重头开始研究。
            </p>
            <p>
              2016年，我们发布了新的Dexmo。虽然有着相似的外骨骼外观，但它实际上基于完全不同的机器人技术架构，它能够持续输出扭矩，并且延迟控制在50毫秒。这是一个巨大的改变，它证明了直驱的力反馈手套的确可以实现。尽管许多人仍然认为它“笨重”，但它表明外骨骼结构是未来力反馈手套的一个可行方式。
            </p>
            <p>
              我们不仅仅是在做一个可用的硬件。我们需要理解和平衡“能够实现”和“应该实现”之间的区别。例如，我们可以在每只手放置20个电机来制作力反馈最逼真的手套，但它的重量将达到1kg，价格贵得离谱，而且完全无法穿戴，这违背了我们的初衷。
            </p>
            <p>
              自2016年，我们的团队大部分时间都在号称“硬件科技的湾区”的深圳，在这里，有各种各样比世界上任何地方都更容易获取的零配件。我们募集了数千万的启动资金，接着投入工作，那时起我们进入了“隐身模式”，停止了一切公关活动。因为我知道要让它真正的达到体验良好，我们仍然有大量的工程问题亟待解决。相比夸大其词，告诉大众这个产品有多棒，但是大众却看不到或试用不了，我更喜欢先着手完成工作，先展示产品再讲故事。我一直认为过度销售是一种危险的策略，不懂适度，反而会适得其反。
            </p>
          </div>
          <div class="video__3mb7h">
            <div class="video__bVhmv">
              <ul
                class="videoThumbnail__17_-H shadow__1pyg5"
                style="position: relative;"
              >
                <this-video
                  :item="{
                    cover: '/img/pro-9.png',
                    src:
                      'https://oss-main.dextarobotics.com/videos/experience/2-dexmo-test.mp4',
                  }"
                />
              </ul>
            </div>
          </div>
          <div class="video__3mb7h">
            <div class="video__bVhmv">
              <ul
                class="videoThumbnail__17_-H shadow__1pyg5"
                style="position: relative;"
              >
                <this-video
                  :item="{
                    cover: '/img/pro-10.png',
                    src:
                      'https://oss-main.dextarobotics.com/videos/experience/3-early-test.mp4',
                  }"
                />
              </ul>
            </div>
          </div>
          <div class="video__3mb7h">
            <div class="video__bVhmv">
              <ul
                class="videoThumbnail__17_-H shadow__1pyg5"
                style="position: relative;"
              >
                <this-video
                  :item="{
                    cover: '/img/pro-11.png',
                    src:
                      'https://oss-main.dextarobotics.com/videos/experience/4-2017.mp4',
                  }"
                />
              </ul>
            </div>
          </div>
          <div>
            <p>
              我们让行业内的专业人士测试了第一批工程样机，他们给出了真实的想法和建议。从我们收集到的反馈来看，他们普遍喜欢我们的产品和使用体验，并对我们的努力表示了极大的赞赏。从他们那里听到他们认为这项技术更先进，这让我们更加坚定了我们走的道路是正确的。
            </p>
            <p>
              虽然我们获得了不错的反馈，但是还有很多需要改进的地方。从那时起，我们开始优化每一个小细节来改进Dexmo，包括人体工学、重量、尺寸、结构完整性、电机控制、无线通讯、制造工艺、交互处理引擎、提供给开发人员的SDK、项目demo……这里涉及了超过16个不同的技术栈，需要软件、控制、电子和机械工程师之间的密切合作。这些工作非常复杂，我们很享受。
            </p>
            <p>
              在Dexmo的开发过程中，软件是一个关键且极具挑战性的部分。为了让人们更容易地使用Dexmo，它不能仅仅以一个硬件设备的形式存在，它还需要成为一个完整的系统。这在我们刚开始的时候确实非常矛盾，为一个尚不存在的硬件构建软件几乎不可能办到，但是在我们有了硬件开始开发软件之后，又很快就意识到有些改进最好直接从硬件上进行调整，而这又会反过来影响软件架构。每次我们更新系统，都要至少花2个月的时间。
            </p>
            <p>
              一个仅仅可用的SDK和一个优秀好用的SDK是非常不同的。2017年我们出货了一些早期测试设备，提供了已被许多人成功应用的SDK，然而，我们的客户仍然遇到了很多问题，最终我们电子邮件来来回回数百封来解决这些问题。我们低估了新硬件系统对软件开发者的困难程度。
            </p>
          </div>
          <img src="/img/pro-12.png" />
          <div>
            <p>
              在VR中建立一个优秀的手部-物体交互界面并不容易，因为这个硬件是前所未有的。因此，我们预定义了许多交互模块，并将它们封装成到示例程序，以帮助开发人员入门。为了使SDK易于使用，它还必须有优秀的文档，这也需要我们额外的工作。在接下来的一年里，我们为SDK制作了循序渐进的分步骤开发指南，即使没有软件开发经验的人也能够按照指南使用SDK。(有件小趣事：我们的一个SDK测试工程师是机械工程专业，刚加入我们团队时，他的编程能力为零，而现在他也可以很轻松地使用SDK。)
            </p>
            <p>
              最具挑战性的部分是了解生产流程。不出所料，大规模地生产如此复杂和新颖的产品是极其困难的。生产力反馈手套并不像生产头戴式显示器，因为后者跟智能手机的硬件组成很相近，可以参考其生产线设计。而没有现成生产线可供我们参考，甚至没有人知道什么是“力反馈手套”。因此，我们的工作不得不继续下沉到生产环节。
            </p>
          </div>
          <img src="/img/pro-13.png" />
          <div>
            <p>
              以我们的力反馈单元为例，在过去的几年里，它经历了几十次迭代。我们开始使用的舵机（展示架的最左边）最初是为遥控车和航模设计的，因此它的空间利用率很低，扭矩传导的结构强度较低。这个舵机单元非常宽，所以很难同时把五个舵机安装在手背上。虽然我们可以做出妥协，把舵机安置在手腕上，但我知道这不是真正解决问题的办法。我们需要不惜一切代价使这个系统尽可能紧凑简洁。所以我们决定从零设计我们自己的舵机系统，从了解舵机的必要组成元件和每个零件的制造过程开始。
            </p>
            <p>
              舵机的外壳是由铝CNC加工而成，这意味着我们可以自定义改变它的几何形状。通过在将扭矩输出轴置中，我们使它变得更薄，同时使结构更稳定。这些齿轮是由滚齿机加工而成，而滚齿机可以加工不同的材料，这表明传动设计也是可以调整的。我们试验了不同材料，寻找最高性能重量比的材料，尽可能的在最轻的质量下获得最佳性能。通过换用具有更高计算能力的芯片集，并放入更多传感器，我们实现了更精密的电机控制。通过改进这些细节，我们开始觉得一切皆有可能。我们一步又一步地深入，最终完全重构了力反馈单元。它的最终形态是专门为力反馈手套设计的，紧凑简洁，显露出一丝优雅。
            </p>
            <p>
              这个例子只是冰山一角，系统的每个部分都经历了像这样极端坎坷的分析和改进。我个人在工厂住了8个月，了解生产加工的每一个细节。我们必须不断平衡工程需求和供应商能够提供的成品，使我们的生产过程平稳可靠。毕竟，如果一个新技术虽然被开发出来，但不能被生产和分享，它的意义也很有限不是吗？
            </p>
          </div>
          <img src="/img/pro-14.png" />
          <div>
            <p>
              对于不熟悉制造过程的人来说，产品原型和最终产成品之间看起来似乎没太大差别。但事实上，尽管其外表相似度有90%，但它们隐藏在外观下所需付出的努力却可能相差数百倍。
            </p>
            <p>以下是硬件制造的一些简单步骤：</p>
            <p>
              产生想法 &gt; 想法的验证 &gt;可运作原型&gt; 工业设计 &gt;
              将工业设计与工作原型有机结合 &gt; 改进 &gt; 工程验证 &gt;
              进一步改进 &gt; 设计验证 &gt; 最终可生产设计&gt; 前期生产准备 &gt;
              零件采购 &gt; 供应商沟通 &gt; 零件质检 &gt; 装配流程设计 &gt;
              零件装配 &gt; 质检测试 &gt; 产品总装 &gt; 整体质检测试
              &gt;最终待发货产品&nbsp;&gt; 包装 &gt; 运输
            </p>
            <p>
              不可避免地，由于各种各样的随机问题，其中一些环节可能会以令人难以置信方式重新反复数次，使得这一切更加更难以推进。例如，在上次的批量生产流程里，当我们以为自己已经掌握了每一道细节时，一个供应商告诉我们，我们的力反馈单元上有些细小的零件被不小心遗留在阳极氧化池里，然后溶解了。这件事导致整个组装推迟了一个月。当我听到这个消息时我放声大笑了很久。苦笑。
            </p>
            <p>
              你们可能会问：为什么不找像富士康这样更可靠的供应商呢？好问题。创新通常意味着最初时产品产量较小，而工厂为了追求最大利润通常只愿意接大批量的订单。这意味着大工厂不想和我们这样的小公司合作，因为对它们来说订单小意味着经济效率低。但我们又必须先小批量销售，然后才能进行大批量生产。很好笑吧？
            </p>
            <p>
              我们花了数年的时间才把它从一个原型变成“可以准备发货”的产品。我想强调的是，这不是一项简单而微不足道的工作。它不是仅仅“设计就绪”或“制造就绪”，而是已经“发货就绪”，这意味着只要有需求，我们就可以成千上万地生产这个产品。
            </p>
            <p>
              我常常看到人们因为一个的实验室里的原型硬件而极度兴奋，然后他们就开始期望团队几个月后就能发货；或者将我们与一些声称产品与我们的同样好用，但其实才成立了几个月的公司相提并论；每当这时我都会无奈长叹。这个想法很可爱，但是将原型与最终成品进行比较是不公平的。任何有Kickstarter硬件项目经验的人都知道我在说什么，在Kickstarter上承诺的所谓“四个月交货”实际上意味着需要两年甚至更长时间，而通常到了最后，大概率都会在这些团队的消失和无数支持者愤怒的声讨中告终。
            </p>
            <p>在进行了所有的这些努力后，这是我们目前取得的成果：</p>
          </div>
          <img src="/img/pro-15.gif" />
          <div>
            <p>
              这在商业化力反馈手套历史上是第一次：我们将5个力反馈装置，11个动作捕捉传感器,可充电电池，以及整个控制系统集成在一只不到300克重量的手套中，兼具高便携性与无线连接，让用户在虚拟世界摆脱束缚，自如地运动双手，而不打破虚拟世界的沉浸感。
            </p>
          </div>
          <img src="/img/pro-16.gif" />
          <div>
            <p>
              Dexmo能够捕捉全手11个自由度的动作，包括大拇指的
              3个自由度（旋转、展开和弯曲）和其余四指各2个自由度（展开和弯曲）。微型力反馈单元可以对用户的指尖施加可达10N的力。其优秀的拇指跟踪，有助于精确重建手部模型。用户可以感受虚拟物体的大小、形状和刚度，从而大大提升了沉浸感，并获得更直观的交互。
            </p>
          </div>
          <img src="/img/pro-17.gif" />
          <div>
            <p>
              我们遵循面向制造设计(DFM)原则，如今我们能够以严格的质量控制标准进行大规模生产。我们的SDK已经被许多早期客户测试过，并且经过一步步改进，现已达到真正“易于使用”的阶段，即使是对VR背景知识知之甚少的人也能够按照分步骤指南使用它。人体工程学是我们关注的另一个非常重要的部分，我们研发了一套特殊的固定机制，使用户既方便舒适又卫生地穿戴Dexmo。
            </p>
            <p>
              基于这些功能，用户第一次可以在VR中看到自己的手，同时还可以真实地感受到自己在抓握并不存在的现实。在VR引入力反馈之前，其沉浸感很容易被打破：每当你试图抓起某个虚拟物体，但看到手指却穿透了它，你就会意识到它不是真实的；当你为了假装拿着虚拟物体而不得不摆出某种姿势时，你就能意识到那不是真实的；无论动画或音效有多逼真，你都能察觉。
            </p>
            <p>
              这绝对不是说我们的系统是完美的，或者说我们能重建人类手部的所有感知，我们现在还不能模拟重量。物理学告诉我们，要想模拟重力，我们需要一整套外接的机械臂系统来产生反作用力；我们也不能模拟温度，因为要想模拟温度，需要将半导体紧密地排布在整个系统中；我们也还不能提供更精确的触觉，其他电机驱动方式还有待进一步探索和研发等等……
            </p>
          </div>
          <img src="/img/pro-18.png" />
          <div>
            <p>
              综上所述，力反馈无疑是虚拟世界中的一个重要的感官维度，一个被渴望已久的虚拟现实人机交互方式，它将VR人机交互的边界又历史性的向前推进了一步。我们的许多软件交互都是基于这项新技术开发的，比如手指的敲击、按压、弹拨、旋转、滑动，按下按键、拉动拉杆、旋转旋钮等等，为了让开发者更容易上手，所有这些动作都在我们的SDK中创建和测试过。当与正确的图形和动画效果相结合时，许多原本不可能实现的应用程序都将成为可能。
            </p>
          </div>
          <img src="/img/pro-19.png" />
          <div>
            <p>
              经常有投资者问我：你们的客户有哪些？这其实是一个很难回答的问题。因为很快每个人都可能成为我们的客户。我一直认为未来VR最基本的硬件配置就是一个头显加上一双力反馈手套。目前我们正在与一些研究机构、前沿工业专家和大学合作，这些合作涵盖了各种各样的项目，例如：飞行模拟、航空航天仿真、航天员训练、笔记本电脑装配线训练、安全生产培训、汽车装配培训、教育、医疗培训、康复训练、大空间游戏、展览、远程操作等。因此各行各业都有我们的潜在客户。力反馈手套确实为虚拟场景增加了另一个层次的沉浸感，使其更加真实。
            </p>
            <p>举几个具体的例子：</p>
            <p>
              我们的一个客户在做笔记本电脑装配线上的员工培训的实验，在中国，很多生产线存在着工人流失率高的问题，这意味着很多熟练工人必须花费大量的时间来教新手操作流程，这就降低了他们的产量和工厂的整体经济效益。第一个实验应用的是Oculus，新入职工人使用Oculus
              Touch在VR中学习装配电脑，虽然他们觉得这很有趣，装配流程中需要灵活使用手指的操作步骤并没有反映在虚拟训练中，这使得该培训软件的训练效果远不如预期。但当他们开始使用Dexmo进行训练时，工人们可以更快更适应地接受培训课程，因为Dexmo的手部互动更直接。
            </p>
            <p>
              还有一个例子是飞行仿真训练。在我们仿真训练领域的客户中，驾驶舱模拟是一个常见场景，它通常需要让用户在VR中拨动开关和按下按钮，而这是手柄无法做到的。在这种情况下，Leap
              Motion相对不稳定，而我们的力反馈技术则可以满足其需求。可以想象一下，在未来飞行员都必须通过VR飞行模拟考试，而不仅仅是阅读手册来猜测要按哪个按钮。
            </p>
            <p>
              在核电站，操作人员可以接受VR培训以应对潜在的核泄漏等紧急情况，他们可以在虚拟环境中学习拉哪个操纵杆，先转动哪个把手或旋钮，接受应对各种可能发生的灾难现场的流程培训；在太空项目中，为了让宇航员预先熟悉太空任务，我们可以用VR技术建造空间站，而不需花大价钱在地面上复制空间站，他们将能够在VR中模拟执行任务。
            </p>
            <p>
              我一直认为Dexmo最大的潜力是在游戏和VR社交领域。在RecRoom中，你可以拿起旗子、投篮、扣下十字弩的扳机等等。想象这一切动作都变得无缝贴近现实，你不需要学习或者记住哪个按钮是做什么动作的，或者按下哪个组合键可以调出菜单栏……你可以做任何你在现实生活中做的动作。你想摘个苹果，就直接用手去摘吧；你想给枪装弹，只要把弹匣插进去，拉一下枪栓即可；你想打开一个盒子，打开电视，喝一瓶水……一切的互动都是直接的。当然，Dexmo带来的帮助远不止我刚才所列出的。
            </p>
            <p>我想你们也有很多问题想问，所以我先简要回答一些常见的问题。</p>
            <p>Dexmo支持Oculus/Vive/PSVR/WMR/HoloLens吗？</p>
            <p>
              是的。Dexmo兼容于大多数房间尺度的VR系统。Dexmo目前还没有一个内置的空间追踪解决方案，因为在这个阶段我们想让它更开放地兼容所有空间追踪解决方案。在技术上，它支持任何带有6自由度的运动手柄的VR系统，所需要的只是一对坐标和方向，以及初始位置校准。HoloLens略有不同，因为它没有自带6自由度的手柄，而且它是一个一体化系统，甚至没有USB
              hub，但如果我们能将一些其他跟踪数据(如OptiTrack)传输到系统中，它仍然可行。
            </p>
            <p>Dexmo的价格？</p>
            <p>
              简而言之：很贵。虽然我希望每个人都能尽快得到Dexmo，但目前的版本实际上是针对B端客户的。先别沮丧，听我说完，我向你保证我们现在之所以这样做是有道理的。
            </p>
            <p>你们公司的未来计划是什么？</p>
            <p>
              2014年，我们取消了Kickstarter的众筹，因为我们意识到Dexmo还没有做好面向消费者的准备。消费者想要的是价格低廉、支持良好、带有大量游戏、开箱即用的产品。功能只是普通消费者想要的众多需求之一。撇开价格因素不谈，我们还没有完备的各项支持。硬件方面，我们需要从SDK层面集成进Facebook，微软，索尼和HTC等头显设备制造者的系统中；在软件方面，我们需要来自开发者社区的支持，在普通消费者购买Dexmo之前先开发好游戏。这些都需要我们现在市场中证明力反馈手套是正确的发展方向。
            </p>
            <p>
              我们计划通过同B端伙伴合作来实现这一目标。通过为早期采用者提供最先进的技术，他们可以开发更令人惊叹的VR项目，从而使他们的经济受益。这些早期采用者愿意为研发做投入，他们可以使用Dexmo进行开发并提供更多有价值的反馈，我们可以一起创造更多令人惊叹的VR体验，来向世人展示一个优秀而完整的VR系统能够做到什么程度。我们希望推动力反馈手套和头显最终成为VR系统的默认硬件配置，到那时它将成为每个人都需要的东西。
            </p>
            <p>作为普通消费者，我们什么时候能买到它？</p>
            <p>
              为了维持公司的运营并不断推进VR人机交互的发展边界，我们需要足够的资金。我们筹集的很多资金都投入到了研发。我们首先需要成为一个盈利的公司，这样才能使力反馈手套的消费者版本更快面世。如果我们提前卖给普通消费者不能使他们满意的产品，而且售价又不能覆盖我们的研发成本，我们将很难实现这个目标。所以，请让更多的人知道Dexmo，尽管你还不能买到它，但大家可以谈论它，分享它的信息，这对于产品的未来很有帮助。当我们每年可以出货数万套Dexmo的时候，凭借规模经济效应和之前做好的市场验证，我们离消费者就不远了。虽然消费者版本的推出时间还不明确，但我们会尽我们所能，让它尽早到达消费者手中&nbsp;:)
            </p>
            <p>
              好的，我们已经接近尾声了。感谢阅读这篇长文。请容许我这样说，我认为Dexmo标志着在沉浸式VR领域踏出的关键一步，它完成了一件既非常困难又及其重要的事情。当然，这个系统离完美还有一定距离。筹集到资金的规模，商业验证推进的时间线，研发上的投入……但我们正在一步步迈向目标。我们在辛苦工作，我们知道自己正在做什么，它将会变得越来越好。这就是我们想要传达的给大家的信息。
            </p>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import thisHeader from './header'
import thisVideo from '@/components/theVideo2'
export default {
  components: { thisHeader, thisVideo },
  methods: {
    goAnchor(id) {
      var anchor = document.querySelector('#' + id)
      //   console.log(anchor.offsetTop)
      window.scrollTo({
        top: anchor.offsetTop - 48,
        behavior: 'smooth',
      })
    },
  },
}
</script>

<style></style>
