[
  {
    "title": "Incomparable Functionality & Ease of Use",
    "img": "https://oss-main.dextarobotics.com/images/home/free-to-use-en.gif",
    "ps": [
      {
        "subtitle": "Portable & Wireless",
        "p": "The whole system weighs only a little under 300g. Unlike other solutions on the market that are either bulky or tethered or both. Dexmo offers a truly wireless force feedback experience enclosed in one elegant compact award-winning package."
      },
      {
        "subtitle": "Rechargeable batteries",
        "p": "Powered by a reliable 1800mAh Li-Po battery, Dexmo can work wirelessly for 8 hours straight, allowing the motors to generate torque at a maximum of 5kg.cm, making long-time development and quality operation possible."
      },
      {
        "subtitle": "With both hand involved",
        "p": "Thanks to the its high portability and wireless connection, you may use both of your hands in the virtual world at ease. Without the tethering of wires, it ensures you a truly free-to-use experience."
      }
    ]
  },
  {
    "title": "A Truly Intuitive Natural Interaction",
    "img": "https://oss-main.dextarobotics.com/images/home/truly-intuitive-natural-interaction-en.gif",
    "ps": [
      {
        "subtitle": "Full Hand Motion Capture",
        "p": "Dexmo captures 11 degrees of freedom hand motion. On top of the bending and splitting motion detection on all fingers, it introduces an additional rotation sensor for the thumb, which allows it to capture the hand motion at full dexterity."
      },
      {
        "subtitle": "High Stiffness & Variable Force",
        "p": "Powered by highly customized servo motors, with compact circuit design and advanced control algorithms, Dexmo’s Direct Drive Method offers higher precision, higher torque output and lower latency than other motors of same sizes."
      },
      {
        "subtitle": "Realistic Haptic Feedback",
        "p": "Dexmo can embed multiple vibration actuators within its main body. These actuators can generate realistic vibrations to simulate the contact of different material surfaces."
      }
    ]
  },
  {
    "title": "The Most Completed Whole Product Experience",
    "img": "https://oss-main.dextarobotics.com/images/home/mass-production-en.gif",
    "ps": [
      {
        "subtitle": "Ergonomic & Hygienic Design",
        "p": "We put a lot of effort into ensuring hygiene and comfort for everybody, such as the memory foam hand pad to soften contact, changeable silicon caps to eliminate contamination and the special wearing mechanism to minimize sweating."
      },
      {
        "subtitle": "SDK Support",
        "p": "The Dexterity Engine, a physics engine we developed contains many plug and play interactive modules. With proven customer use cases, it is safe to say our SDK in both Unity and UE4 makes the development process easy and enjoyable."
      },
      {
        "subtitle": "Manufacturing know-how",
        "p": "We'v spent the past 15 months working on pulling the vendors and pushing through manufacturing cycles in tech hub ShenZhen. Our engineers have over decades of manufacturing experiences, ensuring the delivery of high quality hardware."
      }
    ]
  }
]
